artillery/scenarios/toy-stress.yml
config:
  target: "{{ $processEnvironment.TARGET_API_URL }}"
  phases:
    - duration: 15
      arrivalRate: 50
    - duration: 20
      arrivalRate: 120
    - duration: 20
      arrivalRate: 250
  
  # StatsD plugin to send metrics to Telegraf -> InfluxDB
  plugins:
    statsd:
      host: "{{ $processEnvironment.STATSD_HOST }}"
      port: "{{ $processEnvironment.STATSD_PORT }}"
      prefix: "artillery"

scenarios:
  - flow:
      - randomSwitch:
          - weight: 30
            flow:
              - get: { url: "/fast" }

          - weight: 40
            flow:
              - get: { url: "/slow" }

          - weight: 30
            flow:
              - get: { url: "/cpu" }

      - think: 0.2